Конфигурация отчетов/InformationRegisters/УдаленныеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УдаленныеСчета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаУдаления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтмен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/ВремяПолучениеТокенов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВремяПолучениеТокенов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/ЗаказыКухни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗаказыКухни</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныПриготовления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/Enums/Заведение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Заведение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заболотного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Паустовского</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Таирово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Филатово</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дерибасовская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торговая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Люстдорф</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПицерияЗаболотного</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтерия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кондитерка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черноморск</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Documents/ШаблоныСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ШаблоныСчетов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныПриготовления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товар</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИспользовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Catalogs/Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Сотрудники</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтандартныеСтатьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_Телеграма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Варианты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТИП</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РазновидностьЗПРасчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКассы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВыплаты</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/Catalogs/Заведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Заведения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заведение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Заведение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД_Телеграмм</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициалы_Выгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь_Выгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдрессХоста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗащищеноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/CommonModules/ВВП/Ext/Module.bsl
Функция УдалитьЗаказ(OrderId, Токен, Адрес, МодификацияЗапроса = Ложь)
	ПутьКЛогированию=СокрЛП(Константы.ПутьКЛогированию.Получить());

	// Путь к файлу лога
	ФайлЛога = ПутьКЛогированию+"remove_order_log.txt";
	
	// Открытие файла лога
	Попытка
		ЗаписьЛога = Новый ЗаписьТекста(ФайлЛога, КодировкаТекста.UTF8,, Истина);
		ЗаписьЛога.ЗаписатьСтроку("[" + ТекущаяДата() + "] Начало запроса на удаление заказа");
		ЗаписьЛога.ЗаписатьСтроку("OrderId: " + Формат(OrderId, "ЧГ=0"));
		ЗаписьЛога.ЗаписатьСтроку("Токен: " + ?(СтрДлина(Токен) > 20, Лев(Токен, 20) + "...", Токен));
	Исключение
		Сообщить("Ошибка при открытии файла лога: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		// Настройка соединения
		Сервер = Адрес;
		Порт = 8080;
		
		Ресурс = "/api/v1/orders/" + Формат(OrderId, "ЧГ=0") + "/remove";
		
		Если МодификацияЗапроса = Истина Тогда
			Порт = 443;	
		    HTTPСоединение = Новый HTTPСоединение(Сервер, Порт,,,, 30, Новый ЗащищенноеСоединениеOpenSSL());
		Иначе
			HTTPСоединение = Новый HTTPСоединение(Сервер, ,,,, 30);
		КонецЕсли;
		
	

		// Формирование запроса
		Запрос = Новый HTTPЗапрос;
		Запрос.АдресРесурса = Ресурс;
		
		// Установка заголовка авторизации
		Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
		Запрос.Заголовки.Вставить("ngrok-skip-browser-warning", "true");
		// Логирование запроса
		ЗаписьЛога.ЗаписатьСтроку("URL: http://" + Сервер + ":" + Формат(Порт, "ЧГ=0") + Ресурс);
		ЗаписьЛога.ЗаписатьСтроку("Заголовок Authorization: Bearer " + ?(СтрДлина(Токен) > 20, Лев(Токен, 20) + "...", Токен));
		
		// Выполнение запроса
		Ответ = HTTPСоединение.ВызватьHTTPМетод("POST", Запрос);
		
		// Логирование ответа
		ЗаписьЛога.ЗаписатьСтроку("Код состояния: " + Ответ.КодСостояния);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		ЗаписьЛога.ЗаписатьСтроку("Тело ответа: " + ТелоОтвета);
		
		// Проверка статуса ответа
		Если Ответ.КодСостояния = 200 Или Ответ.КодСостояния = 204 Тогда
			ЗаписьЛога.ЗаписатьСтроку("Запрос успешно выполнен");
			ЗаписьЛога.Закрыть();
			Сообщить("Счет "+OrderId+" был успешно удален!");
			
			Возврат Истина;
		Иначе
			ЗаписьЛога.ЗаписатьСтроку("Ошибка HTTP: Код " + Ответ.КодСостояния);
			Сообщить("Ошибка HTTP: Код " + Ответ.КодСостояния + ". " + ТелоОтвета);
			ЗаписьЛога.Закрыть();
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		ЗаписьЛога.ЗаписатьСтроку("Ошибка при выполнении запроса: " + ОписаниеОшибки());
		ЗаписьЛога.Закрыть();
		Сообщить("Ошибка при выполнении запроса: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции


Функция Получить_ИнформациюСчета(OrderId, Токен, Адрес, МодификацияЗапроса = Ложь)
	ПутьКЛогированию=СокрЛП(Константы.ПутьКЛогированию.Получить());

	// Путь к файлу лога
	//ФайлЛога = ПутьКЛогированию+"remove_order_log.txt";
	
	// Открытие файла лога
	Попытка
		//ЗаписьЛога = Новый ЗаписьТекста(ФайлЛога, КодировкаТекста.UTF8,, Истина);
		//ЗаписьЛога.ЗаписатьСтроку("[" + ТекущаяДата() + "] Начало запроса на удаление заказа");
		//ЗаписьЛога.ЗаписатьСтроку("OrderId: " + Формат(OrderId, "ЧГ=0"));
		//ЗаписьЛога.ЗаписатьСтроку("Токен: " + ?(СтрДлина(Токен) > 20, Лев(Токен, 20) + "...", Токен));
	Исключение
		Сообщить("Ошибка при открытии файла лога: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		// Настройка соединения
		Сервер = Адрес;
		Порт = 8080;
		Ресурс = "/api/v1/orders/" + Формат(OrderId, "ЧГ=0");
		
		Если МодификацияЗапроса = Истина Тогда
			Порт = 443;	
		    HTTPСоединение = Новый HTTPСоединение(Сервер, Порт,,,, 30, Новый ЗащищенноеСоединениеOpenSSL());
		Иначе
			HTTPСоединение = Новый HTTPСоединение(Сервер, ,,,, 30);
		КонецЕсли;

		
		// Формирование запроса
		Запрос = Новый HTTPЗапрос;
		Запрос.АдресРесурса = Ресурс;
		
		// Установка заголовка авторизации
		Запрос.Заголовки.Вставить("Authorization", "Bearer " + Токен);
		Запрос.Заголовки.Вставить("ngrok-skip-browser-warning", "true");
		//
		//// Логирование запроса
		//ЗаписьЛога.ЗаписатьСтроку("URL: http://" + Сервер + ":" + Формат(Порт, "ЧГ=0") + Ресурс);
		//ЗаписьЛога.ЗаписатьСтроку("Заголовок Authorization: Bearer " + ?(СтрДлина(Токен) > 20, Лев(Токен, 20) + "...", Токен));
		
		// Выполнение запроса
		Ответ = HTTPСоединение.ВызватьHTTPМетод("GET", Запрос);
		
		// Логирование ответа
		//ЗаписьЛога.ЗаписатьСтроку("Код состояния: " + Ответ.КодСостояния);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		//ЗаписьЛога.ЗаписатьСтроку("Тело ответа: " + ТелоОтвета);
		
		// Проверка статуса ответа
		Если Ответ.КодСостояния = 200 Или Ответ.КодСостояния = 204 Тогда
			//ЗаписьЛога.ЗаписатьСтроку("Запрос успешно выполнен");
			//ЗаписьЛога.Закрыть();
			Если ПустаяСтрока(ТелоОтвета) Тогда
				Возврат Истина;
			Иначе
				ОтветСтуктура = JSONВСтруктуру(ТелоОтвета);
			КонецЕсли;
			
			Возврат ОтветСтуктура;
		Иначе
			//ЗаписьЛога.ЗаписатьСтроку("Ошибка HTTP: Код " + Ответ.КодСостояния);
			Сообщить("Ошибка HTTP: Код " + Ответ.КодСостояния + ". " + ТелоОтвета);
			//ЗаписьЛога.Закрыть();
			Возврат Ложь;
		КонецЕсли;
		
	Исключение
		//ЗаписьЛога.ЗаписатьСтроку("Ошибка при выполнении запроса: " + ОписаниеОшибки());
		//ЗаписьЛога.Закрыть();
		Сообщить("Ошибка при выполнении запроса: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции


Функция  УдалитьНаСервере(Заведение, НомерСчета, Сумма, Токен) Экспорт
	МодификацияЗапроса = Ложь;
	Если Заведение = Перечисления.Заведение.Люстдорф Тогда
		МодификацияЗапроса = Истина;
	КонецЕсли;

	//ИмяХоста=ПолучениеОбщейИнформации.ПолучитьИмяХоста(Заведение);
	ИмяХоста="";
	Ответ = ""; //ПолучитьИнформациюСчета(НомерСчета, СокрЛП(Токен), ИмяХоста, МодификацияЗапроса);
	Если Ответ = Ложь ИЛИ Ответ = Неопределено Тогда
		Сообщить("Информация о счете не найдета!");
		Возврат Ложь;
	КонецЕсли;
	Если Ответ = Истина Тогда
		Сообщить("Счет "+Строка(НомерСчета)+" был удален ранее!");
		Возврат Ложь;
	КонецЕсли;
	
	СуммаСчетаВКопейках = Ответ["gain"];
	СуммаСчета = СуммаСчетаВКопейках/100; 
	Удален = Ответ["removed"];
	Если Удален = Истина Тогда
		Сообщить("Счет уже был удален ранее!");
		Возврат Ложь;
	КонецЕсли;
	
	Если СуммаСчета <> Сумма Тогда
		Сообщить("Сумма счета не совпадает с суммой счета в программе!");
		Возврат Ложь;
	КонецЕсли;
	
	СтатусУдаления = УдалитьЗаказ(НомерСчета, Токен, ИмяХоста, МодификацияЗапроса);
	ТекстСообщения = Строка(Заведение)+" - счет "+Строка(НомерСчета)+" был успешно удален!";
	ОтправитьОтчетСОтменами(ТекстСообщения);	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОтправитьОтчетСОтменами(ТекстСообщения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Сотрудники.ИД_Телеграма КАК ИД_Телеграма,
		|	Сотрудники.Рассылка КАК Рассылка,
		|	Сотрудники.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Рассылка = &Рассылка";
	
	Запрос.УстановитьПараметр("Рассылка", Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Получатель = Число(Выборка.ИД_Телеграма);
		Telegram.SendMessage(Получатель, ТекстСообщения);	

	КонецЦикла;
КонецПроцедуры


Процедура УдалитьСчет(Заведение, НомерСчета) Экспорт 
	//ПолучитьТокенНаСервере(Заведение.Заведение);
	//УдалитьНаСервере(Заведение.Заведение, НомерСчета, 0,0);
КонецПроцедуры




Процедура ЗаписьУдаленогоСчета(Заведение, НомерСчета, Сумма, ПричинаУдаления) Экспорт 
	Запись = РегистрыСведений.УдаленныеСчета.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.НомерСчета = Число(НомерСчета);
	Запись.Заведение = Заведение;
	Запись.Сумма = Сумма;
	Запись.ПричинаУдаления = ПричинаУдаления;

	Попытка
        Запись.Записать(Истина);
		//Сообщить("Атрибут успешно обновлен " + Строка(Атрибут)); 
    Исключение
        Сообщить("Ошибка при записи в удаленого счета: " + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры 


// Функция преобразует строку JSON в структуру
// Параметры:
//  СтрокаJSON - Строка - строка в формате JSON
// Возвращаемое значение:
//  Структура - результат преобразования JSON
//  Неопределено - если произошла ошибка при разборе

Функция ПроверкаУдаленияСчета(Заведение, НомерСчета, Сумма) Экспорт 
	                                                                                   
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УдаленныеСчета.Заведение КАК Заведение,
		|	УдаленныеСчета.НомерСчета КАК НомерСчета,
		|	УдаленныеСчета.Сумма КАК Сумма
		|ИЗ
		|	РегистрСведений.УдаленныеСчета КАК УдаленныеСчета
		|ГДЕ
		|	УдаленныеСчета.Заведение = &Заведение
		|	И УдаленныеСчета.НомерСчета = &НомерСчета";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	Запрос.УстановитьПараметр("НомерСчета", НомерСчета);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Возврат Истина;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции 


#Область ОбработкаВходныхДанных

Функция JSONВСтруктуруИзСтроки(СтрокаJSON) Экспорт
	
	Результат = Новый Структура;
	
	Попытка
		// Создаем парсер JSON
		ЧтениеJSON = Новый ЧтениеJSON;                           	
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		
		// Читаем JSON и преобразуем в структуру
		Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
		
			ЧтениеJSON.Закрыть();
		
		Возврат Результат;
		
	Исключение
		// Обработка ошибки
		Сообщить("Ошибка при разборе JSON: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция JSONВСтруктуру(СтрокаJSON) Экспорт
	
	Результат = Новый Структура;
	
	Попытка
		// Создаем парсер JSON
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
		
		// Читаем JSON и преобразуем в структуру
		Результат = ПрочитатьJSON(ЧтениеJSON, Истина);
		
		ЧтениеJSON.Закрыть();
		
		Возврат Результат;
		
	Исключение
		// Обработка ошибки
		Сообщить("Ошибка при разборе JSON: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ИзвлечьТокенИзОтвета(ТелоОтвета) Экспорт
	ПутьКЛогированию=СокрЛП(Константы.ПутьКЛогированию.Получить());
	// Путь к файлу лога
	ФайлЛога = ПутьКЛогированию+"auth_log.txt";
	
	// Открытие файла лога
	Попытка
		ЗаписьЛога = Новый ЗаписьТекста(ФайлЛога, КодировкаТекста.UTF8,, Истина);
		ЗаписьЛога.ЗаписатьСтроку("[" + ТекущаяДата() + "] Начало извлечения токена");
	Исключение
		Сообщить("Ошибка при открытии файла лога: " + ОписаниеОшибки());
		Возврат "";
	КонецПопытки;
	
	// Проверка на пустой ответ
	Если ПустаяСтрока(ТелоОтвета) Тогда
		ЗаписьЛога.ЗаписатьСтроку("Ошибка: Тело ответа пустое");
		ЗаписьЛога.Закрыть();
		Сообщить("Ошибка: Тело ответа пустое");
		Возврат "";
	КонецЕсли;
	
	Попытка
		// Чтение JSON-ответа
		ЧтениеJSON = Новый ЧтениеJSON;
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON);
		ЧтениеJSON.Закрыть();
		
		// Извлечение токена
		Если ДанныеОтвета.Свойство("token") Тогда
			Токен = СокрЛП(ДанныеОтвета.token);
			ЗаписьЛога.ЗаписатьСтроку("Токен успешно извлечен: " + Токен);
			ЗаписьЛога.Закрыть();
			Возврат Токен;
		Иначе
			ЗаписьЛога.ЗаписатьСтроку("Ошибка: Поле 'token' не найдено в ответе");
			ЗаписьЛога.Закрыть();
			Сообщить("Ошибка: Поле 'token' не найдено в ответе");
			Возврат "";
		КонецЕсли;
		
	Исключение
		ЗаписьЛога.ЗаписатьСтроку("Ошибка при парсинге ответа: " + ОписаниеОшибки());
		ЗаписьЛога.Закрыть();
		Сообщить("Ошибка при парсинге ответа: " + ОписаниеОшибки());
		Возврат "";
	КонецПопытки;
	
КонецФункции

Функция  ЗаписьТокенаВРегистр(Токен, Заведение) Экспорт  
	Если Токен = "" Тогда
		Сообщить("Попытка записать пустой токен!");
		Возврат Ложь;
	КонецЕсли;
	
	Запись = РегистрыСведений.ВремяПолучениеТокенов.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.Токен = Токен;
	Запись.Заведение = Заведение;


	Попытка
        Запись.Записать(Истина);
		Возврат Истина;
		//Сообщить("Атрибут успешно обновлен " + Строка(Атрибут)); 
	Исключение   
        Сообщить("Ошибка при записи в токена в регистр: " + ОписаниеОшибки());  
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти           


#Область ОбработкаЗапросов
//Процедура КонтролерЗапросов(Заведение, Запрос="", НомерСчета=0, Ид_Стола=0, КодТовара=0, ДатаЗаказов=Неопределено, Ид_Счета=0) Экспорт //собирает все необходимые для дальнеших запросов данные. Вызывается один раз
//	СтандартныеПараметры = ПолучитьСтандартныеПараметры(Заведение, Истина);
//	Если Запрос = "ПолучениеТокенаДоступа" Тогда
//		ПолучениеТокенаДоступа(Заведение, СтандартныеПараметры);
//	ИначеЕсли Запрос = "ПолучитьИнформациюСчета" Тогда
//		ПолучитьИнформациюСчета(Заведение, СтандартныеПараметры, НомерСчета);
//	ИначеЕсли Запрос = "СоздатьНовыйСчет" Тогда
//		СоздатьНовыйСчет(Заведение, СтандартныеПараметры, Ид_Стола);
//	ИначеЕсли Запрос = "ДобавитьНоменклатуруВСчет" Тогда
//		ДобавитьНоменклатуруВСчет(Заведение, СтандартныеПараметры, НомерСчета, КодТовара);
//    ИначеЕсли Запрос = "ПолутьСодержимоеСчета" Тогда
//		ПолутьСодержимоеСчета(Заведение, СтандартныеПараметры, Ид_Счета);
//    ИначеЕсли Запрос = "СозданиеСчетовИзШаблона" Тогда
//		СозданиеСчетовИзШаблона(Заведение, СтандартныеПараметры);
//    ИначеЕсли Запрос = "ПолучениеВсехЗаказовСмены" Тогда
//		ПолучениеВсехЗаказовСмены(Заведение, СтандартныеПараметры, ДатаЗаказов);
//	КонецЕсли;
//	
//КонецПроцедуры  

Функция ПолучитьПарольДоступа()

	Возврат СокрЛП(Константы.ПарольАдминистратора.Получить());	

КонецФункции // ПолучитьПарольДоступа()


Функция ПолучениеТокенаДоступа(Заведение) Экспорт  
	Токен="";
	
	СтандартныеПараметры = ПолучитьСтандартныеПараметры(Заведение, Истина);	
	Хост = СтандартныеПараметры.Хост; 
	Порт = СтандартныеПараметры.Порт;
	ЗащищеноеСоединение = СтандартныеПараметры.ЗащищеноеСоединение;
	
	Если Хост = "" Тогда
		Возврат Токен;
	КонецЕсли;
	
		
	//определить необходимость получать новый токен  
	РезультатПроверки = ПроверкаАктивностиТокена(Заведение); //Либо токен ли ""
	Если НЕ РезультатПроверки = "" Тогда
		Возврат РезультатПроверки;
	КонецЕсли;
	
	//Получаем параметры для запроса
	Если Порт = 0 Тогда
		ПараметрыЗапроса = СоздатьПараметрыЗапросаАвторизации(ПолучитьПарольДоступа(), ЗащищеноеСоединение,); 
	Иначе 
		ПараметрыЗапроса = СоздатьПараметрыЗапросаАвторизации(ПолучитьПарольДоступа(), ЗащищеноеСоединение, Порт);
	КонецЕсли;
	
    Ответ = Запросы.ВыполнитьHTTPЗапрос(Хост, ПараметрыЗапроса);
	Если НЕ Ответ.Успех Тогда
		Возврат Токен;	
	КонецЕсли;
	
	Токен = ИзвлечьТокенИзОтвета(Ответ.ТелоОтвета);
	
	Если Токен = "" Тогда
		Возврат Токен;
	КонецЕсли;
	
	//запись токена  
	РезультатЗаписи = ЗаписьТокенаВРегистр(Токен, Заведение);
	Если РезультатЗаписи = Ложь Тогда
		Возврат Токен; 
	КонецЕсли;          
	
КонецФункции // ПолучениеТокенаДоступа()

Функция ПроверкаАктивностиТокена(Заведение) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремяПолучениеТокеновСрезПоследних.Токен КАК Токен,
		|	ВремяПолучениеТокеновСрезПоследних.Заведение КАК Заведение,
		|	ВремяПолучениеТокеновСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.ВремяПолучениеТокенов.СрезПоследних(, Заведение = &Заведение) КАК ВремяПолучениеТокеновСрезПоследних";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	
	ВремяПолученияТокена = Выборка.Период;
	
	Если ПолучитьРазностьВремени(ВремяПолученияТокена, ТекущаяДата(), "Минута") > 13 ИЛИ ЗначениеЗаполнено(ВремяПолученияТокена) = Ложь Тогда
		Возврат "";
	Иначе
		Возврат СокрЛП(Выборка.Токен);
	КонецЕсли;
	
КонецФункции


Функция ПолучитьСтандартныеПараметры(Заведение, ИсключитьТокен = Ложь) Экспорт 
	Токен="";
	
	СсылкаНаЗаведение = Справочники.Заведения.ПолучитьЗаведение(Заведение);
	Структура = Новый Структура;
	Структура.Вставить("Хост",СсылкаНаЗаведение.АдрессХоста); 
	Структура.Вставить("Порт",СсылкаНаЗаведение.Порт);
	Структура.Вставить("ЗащищеноеСоединение",СсылкаНаЗаведение.ЗащищеноеСоединение);
	Если ИсключитьТокен=Ложь Тогда
		Токен = ПолучениеТокенаДоступа(Заведение);    
	КонецЕслИ;

	Структура.Вставить("Токен",Токен);
	
	
	Возврат Структура;

КонецФункции // ПолучитьСтандартныеНастроки()


Функция ПолучитьИнформациюСчета(Заведение, НомерСчета) Экспорт
	
	СтандартныеПараметры = ПолучитьСтандартныеПараметры(Заведение);
	Токен = СтандартныеПараметры.Токен;
	
	Если Токен = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтандартныеПараметры.Порт = 0 Тогда
		ПараметрыЗапроса = СоздатьПараметрыЗапросаИнформацииСчета(НомерСчета, Токен, СтандартныеПараметры.ЗащищеноеСоединение,); 
	Иначе 
		ПараметрыЗапроса = СоздатьПараметрыЗапросаИнформацииСчета(НомерСчета, Токен, СтандартныеПараметры.ЗащищеноеСоединение,СтандартныеПараметры.Порт);
	КонецЕсли;
	
	Ответ = Запросы.ВыполнитьHTTPЗапрос(СтандартныеПараметры.Хост, ПараметрыЗапроса);
	
	ИнформацияОСчете = JSONВСтруктуруИзСтроки(Ответ.ТелоОтвета);
	
	Возврат ИнформацияОСчете;
	
КонецФункции // ПолучитьИнформациюСчета()

Функция СоздатьНовыйСчет(Заведение, Ид_Стола) Экспорт 
	
	СтандартныеПараметры = ПолучитьСтандартныеПараметры(Заведение);
	Если СтандартныеПараметры.Токен = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтандартныеПараметры.Порт = 0 Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса_СоздатьНовыйСчет(Ид_Стола, СтандартныеПараметры.Токен, СтандартныеПараметры.ЗащищеноеСоединение, );
	Иначе 
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса_СоздатьНовыйСчет(Ид_Стола, СтандартныеПараметры.Токен, СтандартныеПараметры.ЗащищеноеСоединение,СтандартныеПараметры.Порт);
	КонецЕсли;
	
	Ответ = Запросы.ВыполнитьHTTPЗапрос(СтандартныеПараметры.Хост, ПараметрыЗапроса);
	
	ОтветСтруктура = JSONВСтруктуруИзСтроки(Ответ.ТелоОтвета);    
	
	Если Ответ.КодСостояния = 200 Тогда
		
		ПреобразованиеВ_СтруктуруОбъектов(ОтветСтруктура);
		
		Возврат ОтветСтруктура["id"];  
		
	КонецЕсли;                           

		
КонецФункции 

Функция ОписаниеТиповКлючей()
	
	ТипыКлючей = Новый Структура; 
	
	ТипыКлючей.Вставить("id", Тип("Число")); 
	ТипыКлючей.Вставить("removed", Тип("Булево"));   
	ТипыКлючей.Вставить("committed", Тип("Булево")); 
	ТипыКлючей.Вставить("closed", Тип("Булево"));
	ТипыКлючей.Вставить("draftPrinted", Тип("Булево"));
	ТипыКлючей.Вставить("orderPrinted", Тип("Булево"));
	ТипыКлючей.Вставить("crPrinted", Тип("Булево"));
	ТипыКлючей.Вставить("creationDate", Тип("Дата"));
	ТипыКлючей.Вставить("modificationDate", Тип("Дата")); 
	ТипыКлючей.Вставить("closingDate", Тип("Дата"));
	ТипыКлючей.Вставить("shiftId", Тип("Число")); 
	ТипыКлючей.Вставить("waiterId", Тип("Число"));
	ТипыКлючей.Вставить("tableId", Тип("Число"));
	ТипыКлючей.Вставить("discountCardId", Тип("Число"));
	ТипыКлючей.Вставить("description", Тип("Строка"));
	ТипыКлючей.Вставить("notes", Тип("Строка"));
	ТипыКлючей.Вставить("total", Тип("Число"));
	ТипыКлючей.Вставить("totalEx", Тип("Число"));
	ТипыКлючей.Вставить("totalCancelled", Тип("Число")); 
	ТипыКлючей.Вставить("cashGiven", Тип("Число"));
	ТипыКлючей.Вставить("cashPayed", Тип("Число")); 
	ТипыКлючей.Вставить("cashlessPayed", Тип("Число"));
	ТипыКлючей.Вставить("gain", Тип("Число")); 
	ТипыКлючей.Вставить("gainEx", Тип("Число")); 
	
	Возврат ТипыКлючей;
   // на выходе стуктура Ключ - Ключ с JSON, значение - (Стурктура результат валидации и значение)
КонецФункции // ВалидацияЗначенийКлючей()


Функция ПреобразованиеВ_СтруктуруОбъектов(СтруктураJSON) Экспорт 
	
	ТипыКлючей = ОписаниеТиповКлючей();	
	НеИдефицированыеКлючи = Новый Структура;
	
	СтруктураОбъектов = Новый Структура;
	
	Для Каждого Выборка Из СтруктураJSON Цикл
		Если ТипыКлючей.Свойство(Выборка.Ключ) = Неопределено Тогда
			НеИдефицированыеКлючи.Вставить(Выборка.Ключ, Выборка.Значение);
			Продолжить;
		КонецЕсли;
		
		Значение = ?(ТипЗнч(Выборка.Значение) = ТипыКлючей[Выборка.Ключ], 
									Выборка.Значение, 
									УниверсальныеФункции.ПреобразоватьЗначений(Выборка.Значение, Строка(ТипыКлючей[Выборка.Ключ])));
									
		СтруктураОбъектов.Вставить(Выборка.Ключ, Значение);
		//проверка нужного тип
		//преобразование тип
		//установка дефолтного значени
		//не обработаные ключи
	КонецЦикла;
	
	СтруктураОбъектов.Вставить("НеИдефицированыеКлючи", НеИдефицированыеКлючи);
	
	Возврат СтруктураОбъектов;    
	
КонецФункции


Функция ДобавитьНоменклатуруВСчет(Заведение, Ид_Счета, Ид_Товара) Экспорт 
	
	СтандартныеПараметры = ПолучитьСтандартныеПараметры(Заведение);
	Если СтандартныеПараметры.Токен = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтандартныеПараметры.Порт = 0 Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса_ДобавитьВСчет(Ид_Счета, Ид_Товара, СтандартныеПараметры.Токен, СтандартныеПараметры.ЗащищеноеСоединение, );
	Иначе 
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса_ДобавитьВСчет(Ид_Счета, Ид_Товара, СтандартныеПараметры.Токен, СтандартныеПараметры.ЗащищеноеСоединение,СтандартныеПараметры.Порт);
	КонецЕсли;
	
	Ответ = Запросы.ВыполнитьHTTPЗапрос(СтандартныеПараметры.Хост, ПараметрыЗапроса);
	
	ОтветСтруктура = JSONВСтруктуруИзСтроки(Ответ.ТелоОтвета);    
	
	Если Ответ.КодСостояния = 200 Тогда
		
		//Сообщить("Товар успешно добавлен в счет");		
	КонецЕсли;                           


	//Возврат ОтветСтруктура["id"];
	
КонецФункции

Функция ПолутьСодержимоеСчета_v2(Заведение, Ид_Счета) Экспорт 
	
	СтандартныеПараметры = ПолучитьСтандартныеПараметры(Заведение);
	Если СтандартныеПараметры.Токен = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтандартныеПараметры.Порт = 0 Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса_ПолутьСодержимоеСчета(Ид_Счета, СтандартныеПараметры.Токен, СтандартныеПараметры.ЗащищеноеСоединение, );
	Иначе 
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса_ПолутьСодержимоеСчета(Ид_Счета, СтандартныеПараметры.Токен, СтандартныеПараметры.ЗащищеноеСоединение,СтандартныеПараметры.Порт);
	КонецЕсли;
	
	Ответ = Запросы.ВыполнитьHTTPЗапрос(СтандартныеПараметры.Хост, ПараметрыЗапроса);
	
	ОтветСтруктура = JSONВСтруктуруИзСтроки(Ответ.ТелоОтвета);    
	
	Если Ответ.Успех Тогда
   		ТовариИзСчета = Номенклатура_Модуль.ОбработатьМассивТоваровЗаказа(ОтветСтруктура);   
		ТаблицаЗаказа = Номенклатура_Модуль.ПреобразоватьТовары(ТовариИзСчета);         
		
		Возврат ТаблицаЗаказа;  
		
	КонецЕсли;
	
КонецФункции // ПолутьСодержимоеСчета()



Функция ПолутьСодержимоеСчета(Заведение, Ид_Счета) Экспорт //старый
	
	СтандартныеПараметры = ПолучитьСтандартныеПараметры(Заведение);
	Если СтандартныеПараметры.Токен = "" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если СтандартныеПараметры.Порт = 0 Тогда
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса_ПолутьСодержимоеСчета(Ид_Счета, СтандартныеПараметры.Токен, СтандартныеПараметры.ЗащищеноеСоединение, );
	Иначе 
		ПараметрыЗапроса = ПолучитьПараметрыЗапроса_ПолутьСодержимоеСчета(Ид_Счета, СтандартныеПараметры.Токен, СтандартныеПараметры.ЗащищеноеСоединение,СтандартныеПараметры.Порт);
	КонецЕсли;
	
	Ответ = Запросы.ВыполнитьHTTPЗапрос(СтандартныеПараметры.Хост, ПараметрыЗапроса);
	
	ОтветСтруктура = JSONВСтруктуруИзСтроки(Ответ.ТелоОтвета);    
	
	Если Ответ.Успех Тогда
   		ТовариИзСчета = Номенклатура_Модуль.ОбработатьМассивТоваровЗаказа(ОтветСтруктура);   
		ТаблицаЗаказа = Номенклатура_Модуль.ПреобразоватьТовары(ТовариИзСчета);
	    Цех = РегистрыСведений.ЗаказыКухни.ЦехПоИдЗаказа(Ид_Счета, Заведение);
		ЗаказТоваров_Модуль.СоздатьДокументЗаказТоваро(Заведение, Цех, ТаблицаЗаказа, ТекущаяДата(),,Ид_Счета);	
	КонецЕсли;
	
КонецФункции // ПолутьСодержимоеСчета()

Функция СозданиеСчетовИзШаблона(Заведение) Экспорт 
	
	СписокТоваров = СписокТовараИзШаблона(Заведение);
	НомераСчетов = Новый Соответствие;
	//создаем счета
	Для Каждого Запись Из СписокТоваров Цикл
		Цех = Запись.Ключ; 
		СчетСоздан = Ложь;
		Пока СчетСоздан = Ложь Цикл
			НомерСчета = СоздатьНовыйСчет(Заведение, Цех.Ид_Стола);	 
			СчетСоздан = ?(ЗначениеЗаполнено(НомерСчета), Истина, Ложь);
		КонецЦикла;
		НомераСчетов.Вставить(Цех, НомерСчета);	
		ЗаписатьСчетВ_Регистр(Заведение,Цех,НомерСчета,НачалоДня(ТекущаяДата())); 
		ТекстОповещения = "Создан успешно шаблон заполнения на " + Заведение + " для " + Цех;
		ОтправитьОповещениеВЧат(Константы.ИдВладельца.Получить(), ТекстОповещения); 
	КонецЦикла;
	 

	//проверка наличие всех нужнжны счетов
	//повтороное создание тех счетов, что не хватало
	
	Для Каждого Запись Из СписокТоваров Цикл
		Цех = Запись.Ключ; 
		НомерСчета = НомераСчетов.Получить(Цех);
		МассивТоваров = Запись.Значение;
		
		Если МассивТоваров.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого ЭлементМассива Из МассивТоваров Цикл
			ДобавитьНоменклатуруВСчет(Заведение, НомерСчета, Число(Формат(ЭлементМассива.Код)));	
		КонецЦикла;
	КонецЦикла;
	 
	//записываем
	//заполняем
	
	
КонецФункции

Процедура ЗаписатьСчетВ_Регистр(Заведение, Цех, НомерСчета, ДатаЗаказа) Экспорт 
	
	Запись = РегистрыСведений.ЗаказыКухни.СоздатьМенеджерЗаписи();
    Запись.Период = ТекущаяДата();
    Запись.Заведение = Заведение;
    Запись.Цех = Цех; 
	Запись.НомерСчета = НомерСчета; 
    Запись.ДатаЗаказа = ДатаЗаказа;

    Попытка
        Запись.Записать(Истина);
    Исключение
        Сообщить("Ошибка при записи в родителя Задачи: " + ОписаниеОшибки());
    КонецПопытки;

КонецПроцедуры


Функция ПолучениеВсехЗаказовСмены(Заведение, ДатаЗаказов) Экспорт 
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Заведение, "ПеречислениеСсылка.Заведение") 
			ИЛИ НЕ ПроверкиДанных.ВалидацияВходныхДанных(ДатаЗаказов, "Дата") Тогда
		Возврат Неопределено;
	КонецЕсли;
	//получаем список ИД заказов 
	МассивСчетов = ПолучитьСписокИдЗаказов(Заведение, НачалоДня(ДатаЗаказов));
	//получаем и создаем доки заказов               
	Для Каждого ЭлементМассива Из МассивСчетов Цикл
		ПолутьСодержимоеСчета(Заведение, ЭлементМассива); 		
	КонецЦикла;
	//сумируем и создаем общий док заказа    
	ЗаказТоваров_Модуль.СоздатьДокументСумированиеЗаказов(Заведение, НачалоДня(ТекущаяДата()));	
КонецФункции  

Функция ПолучитьСписокИдЗаказов(Заведение, ДатаЗаказов)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыКухниСрезПоследних.НомерСчета КАК НомерСчета
		|ИЗ
		|	РегистрСведений.ЗаказыКухни.СрезПоследних КАК ЗаказыКухниСрезПоследних
		|ГДЕ
		|	ЗаказыКухниСрезПоследних.Заведение = &Заведение
		|	И ЗаказыКухниСрезПоследних.ДатаЗаказа = &ДатаЗаказа";
	
	Запрос.УстановитьПараметр("ДатаЗаказа", НачалоДня(ДатаЗаказов));
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивыСчетов = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		МассивыСчетов.Добавить(Выборка.НомерСчета);	
	КонецЦикла;   
	
	Возврат МассивыСчетов;
	
КонецФункции // ПолучитьСписокИдЗаказов()

Функция СписокТовараИзШаблона(Заведение) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШаблоныСчетовТовар.Номенклатура КАК Номенклатура,
		|	ШаблоныСчетовТовар.Ссылка.Цех КАК Цех
		|ИЗ
		|	Документ.ШаблоныСчетов.Товар КАК ШаблоныСчетовТовар
		|ГДЕ
		|	ШаблоныСчетовТовар.Ссылка.Заведение = &Заведение
		|	И ШаблоныСчетовТовар.НеИспользовать = ЛОЖЬ
		|	И ШаблоныСчетовТовар.Ссылка.Исключить = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Заведение", Заведение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СоответствиеЦехов = Новый Соответствие;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Цех = Выборка.Цех;
		Номенклатура = Выборка.Номенклатура;
		
		// Получаем массив блюд для текущего цеха или создаем новый
		МассивБлюд = СоответствиеЦехов.Получить(Цех);
		Если МассивБлюд = Неопределено Тогда
			МассивБлюд = Новый Массив;
			СоответствиеЦехов.Вставить(Цех, МассивБлюд);
		КонецЕсли;
		
		// Добавляем блюдо в массив, если его там еще нет
		Если МассивБлюд.Найти(Номенклатура) = Неопределено Тогда
			МассивБлюд.Добавить(Номенклатура);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СоответствиеЦехов;     //соответствие (Ключ - цех; Значение - массив товаров)
	
КонецФункции 

#КонецОбласти




#Область ФормированиеПараметровЗапросов     //название функция ПолучитьПараметрыЗапроса_(запрос)

Функция СоздатьПараметрыЗапросаАвторизации(Пароль, МодификацияЗапроса = Ложь, Порт = 8080)    //получение токена доступа
	
	// Формирование заголовков
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("ngrok-skip-browser-warning", "true");
	
	// Формирование параметров URL
	ПараметрыURL = Новый Соответствие;
	ПараметрыURL.Вставить("hostname", "");
	
	// Формирование тела запроса
	ТелоЗапроса = "{""password"":""" + Пароль + """}";
	
	// Определение порта и типа соединения
	Порт = ?(МодификацияЗапроса, 443, Порт);
	ЗащищенноеСоединение = МодификацияЗапроса;
	
	// Формирование параметров запроса
	ПараметрыЗапроса = Запросы.СформироватьПараметрыЗапроса(
		"POST",                     // Метод
		"/api/auth/signin",        // Ресурс
		Порт,                      // Порт
		ЗащищенноеСоединение,      // ЗащищенноеСоединение
		30,                        // Таймаут
		Заголовки,                 // Заголовки
		ПараметрыURL,              // ПараметрыURL
		"",                        // hostname (уже включён в ПараметрыURL)
		ТелоЗапроса,               // ТелоЗапроса
		"UTF-8",                   // Кодировка
		Новый Массив               // ДопустимыеКодыСостояния
	);
		
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция СоздатьПараметрыЗапросаИнформацииСчета(OrderId, Токен, МодификацияЗапроса = Ложь, Порт = 8080) 
	
	// Формирование заголовков
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	Заголовки.Вставить("ngrok-skip-browser-warning", "true");
	
	// Формирование параметров URL
	ПараметрыURL = Новый Соответствие;
	
	// Определение порта и типа соединения
	Порт = ?(МодификацияЗапроса, 443, Порт);
	ЗащищенноеСоединение = МодификацияЗапроса;
	
	// Формирование ресурса
	Ресурс = "/api/v1/orders/" + Формат(OrderId, "ЧГ=0");
	
	// Формирование допустимых кодов состояния
	ДопустимыеКодыСостояния = Новый Массив;
	ДопустимыеКодыСостояния.Добавить(200);
	ДопустимыеКодыСостояния.Добавить(204);
	
	// Формирование параметров запроса
	ПараметрыЗапроса = Запросы.СформироватьПараметрыЗапроса(
		"GET",                     // Метод
		Ресурс,                    // Ресурс
		Порт,                      // Порт
		ЗащищенноеСоединение,      // ЗащищенноеСоединение
		30,                        // Таймаут
		Заголовки,                 // Заголовки
		ПараметрыURL,              // ПараметрыURL
		"",                        // hostname
		"",                        // ТелоЗапроса
		"UTF-8",                   // Кодировка
		ДопустимыеКодыСостояния    // ДопустимыеКодыСостояния
	);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ПолучитьПараметрыЗапроса_СоздатьНовыйСчет(Ид_Стола, Токен, МодификацияЗапроса = Ложь, Порт = 8080)  
		
	// Формирование заголовков
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	Заголовки.Вставить("ngrok-skip-browser-warning", "true");
	
	// Формирование параметров URL
	ПараметрыURL = Новый Соответствие;
	ПараметрыURL.Вставить("tableId", Строка(Формат(Ид_Стола, "ЧГ=0")));
	
	// Определение порта и типа соединения
	Порт = ?(МодификацияЗапроса, 443, Порт);
	ЗащищенноеСоединение = МодификацияЗапроса;
	
	// Формирование ресурса
	Ресурс = "/api/v1/orders";
	
	// Формирование допустимых кодов состояния
	ДопустимыеКодыСостояния = Новый Массив;
	ДопустимыеКодыСостояния.Добавить(200);
	ДопустимыеКодыСостояния.Добавить(204);
	
	// Формирование параметров запроса
	ПараметрыЗапроса = Запросы.СформироватьПараметрыЗапроса(
		"POST",                     // Метод
		Ресурс,                    // Ресурс
		Порт,                      // Порт
		ЗащищенноеСоединение,      // ЗащищенноеСоединение
		30,                        // Таймаут
		Заголовки,                 // Заголовки
		ПараметрыURL,              // ПараметрыURL
		"",                        // hostname
		"",                        // ТелоЗапроса
		"UTF-8",                   // Кодировка
		ДопустимыеКодыСостояния    // ДопустимыеКодыСостояния
	);
	
	Возврат ПараметрыЗапроса;
	
КонецФункции

Функция ПолучитьПараметрыЗапроса_ДобавитьВСчет(Ид_Заказа, Ид_Товара, Токен, МодификацияЗапроса = Ложь, Порт = 8080)

		// Формирование заголовков
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	Заголовки.Вставить("ngrok-skip-browser-warning", "true");
	
	// Формирование параметров URL
	ПараметрыURL = Новый Соответствие;
	ПараметрыURL.Вставить("menuItemId", Строка(Формат(Ид_Товара, "ЧГ=0")));
	
	// Определение порта и типа соединения
	Порт = ?(МодификацияЗапроса, 443, Порт);
	ЗащищенноеСоединение = МодификацияЗапроса;
	
	// Формирование ресурса
	Ресурс = "/api/v1/orders/"+Строка(Формат(Ид_Заказа, "ЧГ=0"))+"/order-items/force";
	
	// Формирование допустимых кодов состояния
	ДопустимыеКодыСостояния = Новый Массив;
	ДопустимыеКодыСостояния.Добавить(200);
	ДопустимыеКодыСостояния.Добавить(204);
	
	// Формирование параметров запроса
	ПараметрыЗапроса = Запросы.СформироватьПараметрыЗапроса(
		"POST",                     // Метод
		Ресурс,                    // Ресурс
		Порт,                      // Порт
		ЗащищенноеСоединение,      // ЗащищенноеСоединение
		30,                        // Таймаут
		Заголовки,                 // Заголовки
		ПараметрыURL,              // ПараметрыURL
		"",                        // hostname
		"",                        // ТелоЗапроса
		"UTF-8",                   // Кодировка
		ДопустимыеКодыСостояния    // ДопустимыеКодыСостояния
	);
	
	Возврат ПараметрыЗапроса;
	

КонецФункции // ПолучитьПараметрыЗапроса_ДобавитьВСчет()

Функция ПолучитьПараметрыЗапроса_ПолутьСодержимоеСчета(Ид_Заказа, Токен, МодификацияЗапроса = Ложь, Порт = 8080)

	// Формирование заголовков
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Authorization", "Bearer " + Токен);
	Заголовки.Вставить("ngrok-skip-browser-warning", "true");
	
	// Формирование параметров URL
	ПараметрыURL = Новый Соответствие;
	
	// Определение порта и типа соединения
	Порт = ?(МодификацияЗапроса, 443, Порт);
	ЗащищенноеСоединение = МодификацияЗапроса;
	
	// Формирование ресурса
	Ресурс = "/api/v1/orders/"+Строка(Формат(Ид_Заказа, "ЧГ=0"))+"/order-items";
	
	// Формирование допустимых кодов состояния
	ДопустимыеКодыСостояния = Новый Массив;
	ДопустимыеКодыСостояния.Добавить(200);
	ДопустимыеКодыСостояния.Добавить(204);
	
	// Формирование параметров запроса
	ПараметрыЗапроса = Запросы.СформироватьПараметрыЗапроса(
		"GET",                     // Метод
		Ресурс,                    // Ресурс
		Порт,                      // Порт
		ЗащищенноеСоединение,      // ЗащищенноеСоединение
		30,                        // Таймаут
		Заголовки,                 // Заголовки
		ПараметрыURL,              // ПараметрыURL
		"",                        // hostname
		"",                        // ТелоЗапроса
		"UTF-8",                   // Кодировка
		ДопустимыеКодыСостояния    // ДопустимыеКодыСостояния
	);
	
	Возврат ПараметрыЗапроса;
		

КонецФункции // ПолучитьПараметрыЗапроса_СодержимоеСчета()


#КонецОбласти


// Функция возвращает разницу между двумя датами/временем
// Параметры:
//  ДатаНачала - Дата - начальная дата/время
//  ДатаОкончания - Дата - конечная дата/время
//  ЕдиницаИзмерения - Строка - "Секунда", "Минута", "Час", "День"
// Возвращаемое значение:
//  Число - разница во времени в указанных единицах измерения
Функция ПолучитьРазностьВремени(ДатаНачала, ДатаОкончания, ЕдиницаИзмерения = "Секунда") Экспорт
	
	// Проверяем корректность дат
	Если НЕ ЗначениеЗаполнено(ДатаНачала) ИЛИ НЕ ЗначениеЗаполнено(ДатаОкончания) Тогда
		Возврат 0;
	КонецЕсли;
	
	// Вычисляем разницу в секундах
	РазницаВСекундах = ДатаОкончания - ДатаНачала;
	
	// Преобразуем в нужную единицу измерения
	Результат = 0;
	
	Если ЕдиницаИзмерения = "Секунда" Тогда
		Результат = РазницаВСекундах;
	ИначеЕсли ЕдиницаИзмерения = "Минута" Тогда
		Результат = РазницаВСекундах / 60;
	ИначеЕсли ЕдиницаИзмерения = "Час" Тогда
		Результат = РазницаВСекундах / 3600;
	ИначеЕсли ЕдиницаИзмерения = "День" Тогда
		Результат = РазницаВСекундах / (3600 * 24);
	Иначе
		ВызватьИсключение "Некорректная единица измерения времени";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Дополнительная логика: цикл создания счетов по цехам
Процедура СоздатьСчетаПоЦехам(Заведение, СоответствиеЦехов)
	
	//Для Каждого Запись Из СоответствиеЦехов Цикл
	//	Цех = Запись.Ключ;
	//	СчетСоздан = Ложь;
	//	
	//	Пока НЕ СчетСоздан Цикл
	//		НомерСчета = СоздатьНовыйСчет(Заведение, Цех.Ид_Стола); // Предполагаемая функция
	//		СчетСоздан = ЗначениеЗаполнено(НомерСчета);
	//	КонецЦикла;
	//	
	//	// Добавляем номенклатуру в счет
	//	ФормироватьНоменклатуруВСчет(Заведение, НомерСчета, "Ид_Товара"); // Пример
	//	
	//	// Оповещение
	//	ТекстОповещения = "Счет " + НомерСчета + " создан в цехе " + Цех;
	//	ОтправитьОповещениеВЧат(Константы.ИдВладельца.Получить(), ТекстОповещения);
	//КонецЦикла;
	//
КонецПроцедуры

// Функция отправки оповещения (пример)
Процедура ОтправитьОповещениеВЧат(ИдВладельца, Текст) Экспорт
	// Логика отправки в чат (через API или другой механизм)
	Сообщить(Текст); // Заглушка
КонецПроцедуры

Процедура ОбработатьЗаказКухни(Заведение, ДатаЗаказа) Экспорт 

	//получить список счетов
	МассивЗаказов = ПолучитьСписокИдЗаказов(Заведение, ДатаЗаказа);	
	
	Для Каждого ЭлементМассива Из МассивЗаказов Цикл
		//получить содержимое каждого счета     
		//создать на каждый счет документ
        НомерСчета = ЭлементМассива;
		ТоварыВЗаказе = ПолутьСодержимоеСчета_v2(Заведение, НомерСчета); 
		
		Если ТоварыВЗаказе = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТоварыВЗаказе.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеЗаказа = Новый Структура;
		ДанныеЗаказа.Вставить("Заведение", Заведение);  
		ДанныеЗаказа.Вставить("Цех", РегистрыСведений.ЗаказыКухни.ЦехПоИдЗаказа(НомерСчета, Заведение));
		ДанныеЗаказа.Вставить("ДатаЗаказа", ДатаЗаказа);
		ДанныеЗаказа.Вставить("ТаблицаЗаказа", ТоварыВЗаказе);
		
		ЗаказТоваров_Модуль.СоздатьДокументЗаказТоваров(ДанныеЗаказа, НомерСчета); 
		
	КонецЦикла;

	//создаем общий документ
	ЗаказТоваров_Модуль.СоздатьДокументСумированиеЗаказов(Заведение, ДатаЗаказа);    
	
	
	//ОтправкаФайлаВТГ("D:\Test folder\Печать накладной.pdf");
КонецПроцедуры

Процедура ОтправкаФайлаВТГ(ПутьКФайлу) Экспорт 
	МойToken = "5762553886:AAGGvAGqUhfOU6zeqXi6QIKc09Uq4zj6NA4"; 
	
	АдресTelegramAPI = "api.telegram.org";
	ЧатID = Константы.ИдВладельца.Получить();

	ПутьКФайлу = СокрЛП(ПутьКФайлу);

	
	Boundary = "----"+Строка(Новый УникальныйИдентификатор());

	Файл = Новый Файл(ПутьКФайлу);

	//Определяем массив для процедуры ОбъединитьФайлы
	МассивФайловДляОбъединения = Новый Массив;

	МассивФайловДляОбъединения.Добавить(ПолучитьИмяВременногоФайла("txt"));
	ФайлОтправкиНачало = Новый ЗаписьТекста(МассивФайловДляОбъединения[0], КодировкаТекста.UTF8);
	НачальныеДанные = "--%Разделитель%
	|Content-Disposition: form-data; name=""chat_id""
	|
	|%ЧатID%
	|--%Разделитель%
	|Content-Disposition: form-data; name=""document""; filename=""%ИмяФайла%""
	|";
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%Разделитель%",Boundary);
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%ЧатID%",ЧатID);
	НачальныеДанные = СтрЗаменить(НачальныеДанные,"%ИмяФайла%",Файл.Имя);

	ФайлОтправкиНачало.ЗаписатьСтроку(НачальныеДанные);
	ФайлОтправкиНачало.Закрыть();

	МассивФайловДляОбъединения.Добавить(ПутьКФайлу);

	МассивФайловДляОбъединения.Добавить(ПолучитьИмяВременногоФайла("txt"));
	ФайлаОтправкиКонец = Новый ЗаписьТекста(МассивФайловДляОбъединения[2], КодировкаТекста.UTF8);
	КонечныеДанные = "
	|--%Разделитель%--";
	КонечныеДанные = СтрЗаменить(КонечныеДанные,"%Разделитель%",Boundary);

	ФайлаОтправкиКонец.ЗаписатьСтроку(КонечныеДанные);
	ФайлаОтправкиКонец.Закрыть();

	ИмяИтоговогоФайла = ПолучитьИмяВременногоФайла("txt");
	ОбъединитьФайлы(МассивФайловДляОбъединения, ИмяИтоговогоФайла);

	
	СоединениеHTTP = Новый HTTPСоединение(АдресTelegramAPI,443,,,,,Новый ЗащищенноеСоединениеOpenSSL());

	АдресЗапроса = "bot" 
	                + МойToken 
	                + "/sendDocument";
					
	ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса);
	ЗапросHTTP.Заголовки.Вставить("Connection", "keep-alive");
	ЗапросHTTP.Заголовки.Вставить("Content-Type", "multipart/form-data; boundary="+Boundary);

	ЗапросHTTP.УстановитьИмяФайлаТела(ИмяИтоговогоФайла);

	Попытка
		ОтветHTTP = СоединениеHTTP.ОтправитьДляОбработки(ЗапросHTTP);
		
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры
